## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization  | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

_**Hint:** If "Terraform Format & Style" failed, run `terraform fmt -recursive` from the `terraform/` directory and commit the results._

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-   destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_ecs_service.console will be updated in-place
  ~ resource "aws_ecs_service" "console" {
        id                                 = "arn:aws:ecs:us-west-2:357150818708:service/cpfreporter/cpfreporter-console"
        name                               = "cpfreporter-console"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:68" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.console must be replaced
+/- resource "aws_ecs_task_definition" "console" {
      ~ arn                      = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:68" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ image                  = "ghcr.io/usdigitalresponse/cpf-reporter-console@sha256:53ff66adc48fc71f352fca664e1bb66dce9e1392fab08cecf19c836de20078df" -> "ghcr.io/usdigitalresponse/cpf-reporter-console@sha256:bb6fe0e419912aba4f7f1c29a2bfb7037b0521f9cf1e9dde50bad026a51b2134"
-                   mountPoints            = []
                    name                   = "console"
-                   portMappings           = []
-                   systemControls         = []
-                   volumesFrom            = []
                    # (7 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "cpfreporter-console" -> (known after apply)
      ~ revision                 = 68 -> (known after apply)
-       tags                     = {} -> null
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_s3_object.lambda_artifact-cpfValidation must be replaced
-/+ resource "aws_s3_object" "lambda_artifact-cpfValidation" {
+       acl                    = (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "790ffef857eea6863b2c57ba79ee7589-5" -> "0b8a868533f784cb7feb01a38dbfe352"
      ~ id                     = "cpfValidation.2032d24a1faa622f8d6365689cbbcf21.zip" -> (known after apply)
      ~ key                    = "cpfValidation.2032d24a1faa622f8d6365689cbbcf21.zip" -> "cpfValidation.0b8a868533f784cb7feb01a38dbfe352.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source_hash            = "2032d24a1faa622f8d6365689cbbcf21" -> "0b8a868533f784cb7feb01a38dbfe352"
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "l9rCszu0.NhxIgxHcBYi53Z8wV97ZbND" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-excelToJson will be updated in-place
  ~ resource "aws_s3_object" "lambda_artifact-excelToJson" {
      ~ etag                   = "be8931411b1c45bd9867987446f38b7b-6" -> "c14f94724ff345d2473505225992af61"
        id                     = "excelToJson.c14f94724ff345d2473505225992af61.zip"
        tags                   = {}
      ~ version_id             = "jm4Nbmy9qHl8eqLmd.GF8_3.GfJXWAgr" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-graphql must be replaced
+/- resource "aws_s3_object" "lambda_artifact-graphql" {
+       acl                    = (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "19960058fc8172622ec9fb255822f7ce-6" -> "640021f2c6b16b805db14cd0217749a4"
      ~ id                     = "graphql.2a2975255328d004632c2d2619ecb34a.zip" -> (known after apply)
      ~ key                    = "graphql.2a2975255328d004632c2d2619ecb34a.zip" -> "graphql.640021f2c6b16b805db14cd0217749a4.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source_hash            = "2a2975255328d004632c2d2619ecb34a" -> "640021f2c6b16b805db14cd0217749a4"
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "mEjftP6LqGUUhrox65A4m5JJVW39WJFC" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["200.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "3eb7d4b937148be9cf759013c831a4d3" -> "b67979f6969eddc3678e4f2402c1858f"
        id                     = "dist/200.html"
      ~ source_hash            = "3eb7d4b937148be9cf759013c831a4d3" -> "b67979f6969eddc3678e4f2402c1858f"
        tags                   = {}
      ~ version_id             = "QMAv0a7oRhjjz_wHNiNKxGhF..4bj.6N" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["build-manifest.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "49609f8f59b93353e3305ed6f044b1a1" -> "71895d356089997caa8ed1d4dd90ddff"
        id                     = "dist/build-manifest.json"
      ~ source_hash            = "49609f8f59b93353e3305ed6f044b1a1" -> "71895d356089997caa8ed1d4dd90ddff"
        tags                   = {}
      ~ version_id             = "Iy7TJWBr2NeYMLvS1Mz1Jk7j6UEnhOM4" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["chunk-references.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "df7404554443ef4d2d15eec91eec403c" -> "96db4738ee89bb80d81a618652242b84"
        id                     = "dist/chunk-references.json"
      ~ source_hash            = "df7404554443ef4d2d15eec91eec403c" -> "96db4738ee89bb80d81a618652242b84"
        tags                   = {}
      ~ version_id             = "3lRJqRg_bXzOvxgUKnNi.tmR.OUhQN9y" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "3eb7d4b937148be9cf759013c831a4d3" -> "b67979f6969eddc3678e4f2402c1858f"
        id                     = "dist/index.html"
      ~ source_hash            = "3eb7d4b937148be9cf759013c831a4d3" -> "b67979f6969eddc3678e4f2402c1858f"
        tags                   = {}
      ~ version_id             = "TXla0gN8GoJE61ZhRpdqJhEaT1n4F6L_" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.152d361b.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "f7e0415554331c2d3bb99ad3c2c25e4c"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.152d361b.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.152d361b.js"
+       source_hash            = "f7e0415554331c2d3bb99ad3c2c25e4c"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.152d361b.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "b703266ba347d460c07ac79899e011fa"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.152d361b.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.152d361b.js.LICENSE.txt"
+       source_hash            = "b703266ba347d460c07ac79899e011fa"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.7e6707d5.js"] will be destroyed
  # (because key ["static/js/app.7e6707d5.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "c2a60a30d9c8e8bc1f9107e71d7ee1ce" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.7e6707d5.js" -> null
-       key                    = "dist/static/js/app.7e6707d5.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.7e6707d5.js" -> null
-       source_hash            = "c2a60a30d9c8e8bc1f9107e71d7ee1ce" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "N77gBBiZxbBF59RIvU7aW3qgK19L1Oac" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.7e6707d5.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/app.7e6707d5.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "b703266ba347d460c07ac79899e011fa" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.7e6707d5.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/app.7e6707d5.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.7e6707d5.js.LICENSE.txt" -> null
-       source_hash            = "b703266ba347d460c07ac79899e011fa" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "ly4gJKj1f7KQtkhTKDdebPNVVBCJiz8c" -> null
    }

  # module.lambda_function-cpfValidation.aws_iam_policy.additional_inline[0] will be updated in-place
  ~ resource "aws_iam_policy" "additional_inline" {
        id        = "arn:aws:iam::357150818708:policy/cpfreporter-cpfValidation-inline"
        name      = "cpfreporter-cpfValidation-inline"
      ~ policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Resource = "arn:aws:s3:::cpfreporter-reportingdata-357150818708-us-west-2/uploads/*/*/*/*/*/*.xlsm.json" -> "arn:aws:s3:::cpfreporter-reportingdata-357150818708-us-west-2/uploads/*/*/*/*/*.xlsm.json"
                        # (3 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags      = {}
        # (4 unchanged attributes hidden)
    }

  # module.lambda_function-cpfValidation.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-cpfValidation"
      ~ last_modified                  = "2024-04-02T12:02:21.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-cpfValidation:37" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-cpfValidation:37/invocations" -> (known after apply)
      ~ s3_key                         = "cpfValidation.2032d24a1faa622f8d6365689cbbcf21.zip" -> "cpfValidation.0b8a868533f784cb7feb01a38dbfe352.zip"
        tags                           = {}
      ~ version                        = "37" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                = "c8cb47f29d7d6c526f3c9117921439a855928e97" -> "0ea45a607103c2dc894826397e30bce7b5c08370"
              ~ "DD_TAGS"                      = "git.commit.sha:c8cb47f29d7d6c526f3c9117921439a855928e97,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:0ea45a607103c2dc894826397e30bce7b5c08370,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                   = "c8cb47f29d7d6c526f3c9117921439a855928e97" -> "0ea45a607103c2dc894826397e30bce7b5c08370"
                # (13 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.lambda_function-cpfValidation.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "37" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function-excelToJson.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-excelToJson"
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-excelToJson:37" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-excelToJson:37/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "37" -> (known after apply)
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                = "c8cb47f29d7d6c526f3c9117921439a855928e97" -> "0ea45a607103c2dc894826397e30bce7b5c08370"
              ~ "DD_TAGS"                      = "git.commit.sha:c8cb47f29d7d6c526f3c9117921439a855928e97,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:0ea45a607103c2dc894826397e30bce7b5c08370,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                   = "c8cb47f29d7d6c526f3c9117921439a855928e97" -> "0ea45a607103c2dc894826397e30bce7b5c08370"
                # (13 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.lambda_function-excelToJson.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "37" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function-graphql.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-graphql"
      ~ last_modified                  = "2024-04-02T12:02:35.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:84" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:84/invocations" -> (known after apply)
      ~ s3_key                         = "graphql.2a2975255328d004632c2d2619ecb34a.zip" -> "graphql.640021f2c6b16b805db14cd0217749a4.zip"
        tags                           = {}
      ~ version                        = "84" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                      = "c8cb47f29d7d6c526f3c9117921439a855928e97" -> "0ea45a607103c2dc894826397e30bce7b5c08370"
              ~ "DD_TAGS"                            = "git.commit.sha:c8cb47f29d7d6c526f3c9117921439a855928e97,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:0ea45a607103c2dc894826397e30bce7b5c08370,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                         = "c8cb47f29d7d6c526f3c9117921439a855928e97" -> "0ea45a607103c2dc894826397e30bce7b5c08370"
                # (17 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # module.lambda_function-graphql.aws_lambda_permission.current_version_triggers["APIGateway"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "APIGateway" -> (known after apply)
      ~ qualifier           = "84" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 8 to add, 10 to change, 8 to destroy.
```

</details>

*Pusher: @jakekreider, Action: `pull_request_target`, Workflow: [`Continuous Integration`](https://github.com/usdigitalresponse/cpf-reporter/actions/runs/8532260289)*